BlogSite/app/controllers/posts_controller.rb

  def create
    @post = Post.new(post_params)
    @post.account_id = current_account.id

    if @post.save
---
INSERT INTO "posts" ("title", "summary", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "My first blog post"], ["summary", "post test"], ["body", "sdf"], ["created_at", "2020-08-26 18:23:26.152153"], ["updated_at", "2020-08-26 18:23:26.152153"]]

  def update
    if @post.update(post_params)
---
UPDATE "posts" SET "body" = $1, "updated_at" = $2 WHERE "posts"."id" = $3  [["body", "sdfsdafasdfads\r\nsadfasdf\r\ndsafasdf"], ["updated_at", "2020-08-26 18:40:20.721927"], ["id", 1]]

  def save_post_view
    # increment view count for post
    @post.increment(:views, 1).save
---
INSERT INTO "posts" ("title", "summary", "body", "created_at", "updated_at", "category_id", "account_id") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"