BlogSite/app/controllers/public_controller.rb

SELECT "posts".* FROM "posts" WHERE "posts"."active" = $1 ORDER BY "posts"."created_at" DESC LIMIT $2  [["active", true], ["LIMIT", 2]]
SELECT "categories".* FROM "categories"
---
  def homepage
    @posts = Post.active.order_by_latest_first.limit_5
    @categories = Category.all