BlogSite/app/models/post.rb

  def update_total_posts_count
    category.increment(:total_count, 1).save
---
UPDATE "categories" SET "total_count" = $1, "updated_at" = $2 WHERE "categories"."id" = $3  [["total_count", 1], ["updated_at", "2020-08-28 15:13:17.522161"], ["id", 1]]