BlogSite/app/views/posts/_form.html.erb

  <%= form.label :category_id %>
  <%= form.select :category_id, Category.all.collect{|c| [c.title, c.id]} %>
---
SELECT "categories".* FROM "categories"